[
  {
    "id": 0,
    "author": "Jay Peter",
    "title": "Ticketmaster will start using Apple Wallet’s more useful tickets this month",
    "description": "Ticketmaster announced that it will be the first ticketing company to use Apple’s upgraded Apple Wallet tickets for iOS 18. The first event to use the tickets will be an October 19th Los Angeles Football Club game.",
    "url": "https://www.theverge.com/2024/10/10/24267269/ticketmaster-apple-wallet-new-tickets",
    "urlToImage": "https://cdn.vox-cdn.com/thumbor/ogn1mVbYQv9S5xK9iYeuplQo7Es=/0x0:2048x1150/1200x628/filters:focal(1024x575:1025x576)/cdn.vox-cdn.com/uploads/chorus_asset/file/25670129/Apple_Wallet_B2B_Blog_Header_204.jpg",
    "publishedAt": "January 5, 2024",
    "content": "Ticketmaster announced today that it will be the first ticketing company to use Apple’s upgraded Apple Wallet tickets for iOS 18. With the improved tickets, you’ll be able to see event information “such as a map of the venue and parking details, recommended playlists from Apple Music, local forecasts from Weather, and easy access to location sharing to help fans find their friends when they arrive,” Ticketmaster says. Venues and teams will also be able to add links to their app or website.\r\n\r\n The first Ticketmaster event to use the upgraded tickets will be the October 19th Los Angeles Football Club game at BMO Stadium. Ticketmaster says the Miami Heat will be “next to debut” the new ticket experience, though the company didn’t say exactly when that might happen. The improved ticket experience will be “more widely available” next year.\r\n\r\n We’ve asked Ticketmaster if it can share more details about the broader rollouts."
  },
  {
    "id": 1,
    "author": "Joe Tilleli",
    "title": "Prime Day May Be Over But These Apple AirTags Are Still 19% off",
    "description": "Get an individual Apple AirTag for $25 or four for just $80 even though Prime Day has come and gone.",
    "url": "https://gizmodo.com/prime-day-may-be-over-but-these-apple-airtags-are-still-19-off-2000510521",
    "urlToImage": "https://gizmodo.com/app/uploads/2024/10/AirTag.jpg",
    "publishedAt": "February 10, 2024",
    "content": "Prime Day has come in gone. If you’ve been asleep, away from your computer for the past two days, then you may have woken up thinking you’ve missed your big chance to save some cash on gadgets and gizmos you’ve had your eye on for either yourself or as gifts this holiday season. We’ll I’m happy to let you know, you are wrong about that. Yes, Prime Day is over but there are always good deals to be found. For instance, here we have an Apple AirTag, an easy way to keep track of your belongings, for 14% off. They even have a four-pack going for 19% off. You can get the bundle for $80 or buy them individually for just $25 a pop.\n\n The Find My app is an excellent way to keep track of your Apple devices. I’ve used it to located an iPhone I once left at a restaurant, a MacBook I left at a coffee shop, and even an Apple Watch that fell into a river …. I should probably just keep better care of my stuff. But it’s undeniable how handy the Find My app can be in a crisis — or even just to track friends if you plan on meeting up in an unfamiliar city. It sure would be great to be able to use the Find My app on more than just Apple products."
  },
  {
    "id": 2,
    "author": "Joe Tilleli",
    "title": "The Prime Day Price of the Apple MacBook Air Hasn’t Gone Back Up Yet",
    "description": "Get the 25% off Apple 2022 MacBook Air laptop with M2 chip for its Prime Day price before they remember to change it back.",
    "url": "https://gizmodo.com/the-prime-day-price-of-the-apple-macbook-air-hasnt-gone-back-up-yet-2000510765",
    "urlToImage": "https://gizmodo.com/app/uploads/2024/10/MAcBookAirM2.jpg",
    "publishedAt": "March 15, 2024",
    "content": "The October Prime Days we’ve been waiting months for has already ended. These two days of deals took place earlier this week on October 8 and October 9. Now here we are on October 10, but it looks like someone forgot to tell Apple the event has ended. For the past two days, Amazon has had the Apple 2022 MacBook Air laptop with M2 chip priced at $749. This is a 25% discount from its normal price of $999 — amounting to a total savings of $250. However, if you go to the product page right now, you’ll see it is still listed at $749. That means it’s not too late so save a whole lot on a new MackBook Air for the holidays.\n\n This laptop is an excellent option for anyone who values portability above all. The 2022 model weighs in at only 2.7 pounds and is strikingly thin in its design. Despite its sleek size and shape, this laptop is just as capable as ever — having been built on the M2 chipset. This impossibly thin form factor still manages to get high performance out of it, somehow managing to fit an 8-core CPU along with the up to 10-core GPU and 24GB of memory. When compared to the MacBook Air with the M1 chipset, this comes in up to 1.4 times faster and a staggering 12 times faster than the Intel-based MacBook Air.\n\n Long stretches of work time are no issue at all thanks to this thing’s battery — it reaches up to 18 hours in a single charge. Do you spend a lot of time on work calls with Zoom? The front facing camera is capable of 1080p video and uses a three-mic array to makes sure when it picks up your audio, it comes through crisp and clear."
  },
  {
    "id": 3,
    "author": "Kyle Barrs",
    "title": "The Apple Vision Pro’s First ‘Immersive’ Movie Looks Incredible Due to Classic Filmmaking Techniques",
    "description": "Apple's first directed short ‘immersive’ movie for Vision Pro, Submerged, shows spatial movies may take more effort than your typical film.",
    "url": "https://gizmodo.com/the-apple-vision-pros-first-immersive-movie-look-incredible-due-to-classic-filmmaking-techniques-2000510024",
    "urlToImage": "https://gizmodo.com/app/uploads/2024/10/Apple-Vision-Pro-immersive-video-Submerged-2.jpg",
    "publishedAt": "April 20, 2024",
    "content": "The one thing every current Apple Vision Pro owner demands is—to put it simply—more. That is more features and more content. The latest push from Apple to make good on the promise of its first “spatial computer” is Submerged, a short movie directed by noted filmmaker Edward Berger and designed wholly for the Vision Pro. It’s a fun watch, well worth the 17 minutes of strapping the Vision Pro to your noggin. And still, after watching it and other “immersive” content, I’m still left wanting more. \r\n\r\n Apple allowed Gizmodo an early look at Submerged before its full release Thursday for free on the Apple TV app. I’ve watched plenty of immersive videos and traditional content on Vision Pro while I await the fabled update that will finally add a 180-degree wraparound screen to visionOS 2. Just like the short documentaries in series like Elevated and Adventure, this short-form content is a nice distraction, but once you watch them once there is little reason to go back."
  },
  {
    "id": 4,
    "author": "Kyle Barr",
    "title": "This Bracelet Allows You to ‘Touch’ a Loved One, No Matter Where You Are",
    "description": "The Bond Touch 4 bracelet lets you send “touches” to loved ones, and the updated version includes better ‘touch sensitivity.’",
    "url": "https://gizmodo.com/this-bracelet-allows-you-to-touch-a-loved-one-no-matter-where-you-are-2000510571",
    "urlToImage": "https://gizmodo.com/app/uploads/2024/10/Bond-Touch-4-hands-holding-2.jpg",
    "publishedAt": "May 25, 2024",
    "content": "I’m still waiting for the device that will let me “reach out and touch faith,” as Depeche Mode once sang. Instead, we’re still beholden to this mortal coil, lingering in a state where one may long for physical affection but find none of it in today’s online-obsessed world. To fill this void, the Bond Touch 4 bracelet offers long-distance intimacy in a slim, wearable package. As the name suggests, it lets you touch people from a distance.\n\nThe $70 Bond Touch 4 can send and receive signals from other users with the same wearable, feeling on their skin as if their loved one was tapping them. Through the Bond Touch app, users can modify their own types of haptic expressions on a loved one’s wrist from anywhere with an internet connection. The makers of the device, also called Bond Touch, said the wrist-mounted remote toucher is made best for couples in long-distance relationships, friends living apart, or even somebody who uses physical intimacy as a tool for calming nerves. \n\nBond Touch says the newly redesigned bracelet is more compact than previous versions. More importantly for those craving the touch of their loved ones, the new device has “improved sensitivity for a faster and more accurate response.” This new rendition of the company’s “emotional wearable” tech has a brighter LED visor and a better magnetic charger with its promised 4-day battery life. However, you might get less if you end up sending more than 20 touches a day. It may seem like a lot of touching, but for those who communicate with “Touch Language,” as the company puts it, that could be a short conversation."
  },
  {
    "id": 5,
    "author": "Gizmodo Deals",
    "title": "Prime Day: Amazon is Not Done Yet, Here Are the 10 Best Deals for This Thursday",
    "description": "Amazon aims to capitalize on the Prime Day momentum by continuing to provide substantial discounts across a wide range of products in its inventory.",
    "url": "https://gizmodo.com/prime-day-amazon-is-not-done-yet-here-are-the-10-best-deals-for-this-thursday-2000510289",
    "urlToImage": "https://gizmodo.com/app/uploads/2024/10/prime-day-amazon-october-24.jpg",
    "publishedAt": "June 30, 2024",
    "content": "As we enter the final hours of Amazon’s extended Prime Day event on this Indigenous Peoples’ Day, Monday, October 14, 2024, shoppers are presented with a last-chance opportunity to snag incredible deals. Amazon has made all offers accessible to everyone, including non-Prime members, for this final push. However, the clock is ticking, and stock shortages are becoming a significant challenge.\n\n The extended sale has seen remarkable discounts on a wide range of products with Apple items remaining particularly popular. The AirPods Pro 2 continue to be available at $199 down from their original $249 price tag. The 9th generation iPad maintains its impressive 32% discount, while AirTags are still on offer at $79 for a 4-pack.\n\nAmazon’s own devices have not been left out of the festivities during this Prime Day with Echo speakers and Ring security cameras seeing massive discounts of 40% to 70%. Headphones from Sony, Beats, and Bose are also part of the extended Prime Day offerings. Home appliances, gaming devices (including the PS5 Standard and PS5 Digital Edition), beauty products, and toys round out the diverse array of discounted items.\n\nLego enthusiasts have not been forgotten in this final push for this Prime Day. The Lego Star Wars Advent Calendar is available at a 20% discount which makes it an ideal gift for those looking to count down to the holidays with a daily surprise. The Lego Harry Potter Castle, priced at $135 down from $169, is also a top seller in the past few days.  "
  },
  {
    "id": 6,
    "author": "tips@androidcentral.com (Nickolas Diaz)",
    "title": "Amazon's Apple TV Plus add-on for Prime Video is a huge content library expansion",
    "description": "Amazon announced its plans to bring an Apple TV Plus add-on to its Prime Video subscribers.",
    "url": "https://www.androidcentral.com/streaming-tv/amazon-prime-video-apple-tv-plus-add-on-detailed",
    "urlToImage": "https://cdn.mos.cms.futurecdn.net/YFTTF9qXeaniuezXUpDSoM-1200-80.jpg",
    "publishedAt": "July 1, 2024",
    "content": "Here's a surprising duo you never knew was coming: Amazon's Prime and Apple TV Plus.\n\nAmazon announced in a Newsroom post that it will 'soon' bring an Apple TV add-on to its Prime Video streaming service. The Senior Vice President and Head of Prime Video and Amazon MGM Studios, Mike Hopkins said in a statement, '... we are proud to welcome Apple TV+ and its popular and critically-acclaimed shows, films and events to Prime Video.'\n\nMike Hopkins also stated the inclusion of an Apple TV Plus add-on would give users a more 'personalized' streaming experience with additional options.\n\nThe company highlighted shows like The Morning Show, Palm Royale, Shrinking, and Hijack. Additionally, it stated a host of Apple Original films joined the fray, including the movie CODA.\n\nSports lovers who already have Prime Video for the NFL's Thursday Night Football broadcasts can grab games from Apple TV Plus' MLS Season Pass. The MLB is featured on the streaming service every Friday for its 'Friday Night Baseball' featurette. This brings a double-header to subscribers every Friday.\n\nPrime Video subscribers in the U.S. can grab the Apple TV Plus add-on for an extra $9.99 monthly. The subscription will roll out 'later this month', letting users watch extra content across multiple devices. Moreover, as Android Police noted, Amazon's Apple TV Plus add-on helps relieve stress for Android. The streaming service didn't previously have any 'native' support on Android, but this will rectify that in one fell swoop."
  }
]